import Head from "next/head";
import classes from "./classes.module.css";
import HorizontalLine from "../../components/HorizontalLines/HorizontalLine/HorizontalLine";
import { useRouter } from "next/router";
import { motion } from "framer-motion";

const variants = {
  hidden: { opacity: 0, x: -200, y: 0 },
  enter: { opacity: 1, x: 0, y: 0 },
  exit: { opacity: 0, x: 0, y: -100 },
};

function History(props) {
  const router = useRouter();

  function Home() {
    router.push("/");
  }
  return (
    <>
      <Head>
        <title>Α.Σ. Μακεδονική Δύναμη Κοζάνης Ιστορία Συλλόγου </title>
        <meta
          name="description"
          content="Η Ιστορία του αθλητικού Συλλόγου Ταε-Κβον-Ντο και μοντέρνου Χορού Ρυθμικής αερόβιας Γυμναστικής."
        />
      </Head>
      <div
        className={classes.containerr}
      >
        <HorizontalLine title={"Ιστορία-Σύλλογος"} />
        <p className={classes.text_intro}>
          {/* Ο Α.Σ. Μακεδονική Δύναμη Κόζάνης είναι αναγνωρισμένο και ενεργό μέλος της Ελληνικής Ομοσπονδίας TAE-KWON-DO (ΕΛ.Ο.Τ.) με Ειδική Αθλητική Αναγνώριση από την Γενική Γραμματεία Αθλητισμού και αναγνωρισμένο και ενεργό μέλος της Ελληνικής Γυμναστικής Ομοσπονδίας (Ε.Γ.Ο.). <br />Ο Σύλλογος ιδρύθηκε το 1990 με όραμα και ιδεώδες τη δημιουργία ενός «νέου συλλόγου», που είχsε και έχει σαν θεμέλιο λίθο την αγάπη προς τα παιδιά και τον αθλητισμό. Στην μακροχρόνια και ανοδική πορεία του, εκτός από το Tae Know Do, με το οποίο ξεκίνησε έχει αγκαλιάσει και άλλα αθλήματα, όπως τη Ρυθμική και το Αερόμπικ. <br /> Μέσα από τη νέα ιστοσελίδα, αθλητές μέλη και μη θα έχουν την ευκαιρία να ενημερωθούν άμεσα για τις τελευταίες εξελίξεις του συλλόγου και του αθλήματος του Tae-Kwon-Do. Σε έναν χώρο 600 τ.μ
          στο κέντρο της πόλης με 4 αίθουσες προπόνησης. Τηρώντας το υγειονομικό πρωτόκολλο της Γ.Γ.Α. */}
          Ο σύλλογός μας με την επωνυμία ΄Α.Γ.Σ. ΚΟΖΑΝΗΣ ΜΑΚΕΔΟΝΙΚΗ ΔΥΝΑΜΗ’
          ιδρύθηκε το 1988. Εδώ και 33 χρόνια λοιπόν δραστηριοποιείται στα
          αθλήματα του Taekwondo, της ενόργανης και της ρυθμικής γυμναστικής,
          του μοντέρνου χορού, της αγωνιστικής αεροβικής, της μουσικοκινητικής
          αγωγής και μπλαλέτου του Kick Boxing και Muay Thai. Επίσης, απασχολεί
          στις τάξεις του, 10 γυμναστές και προπονητές των αντίστοιχων
          ειδικοτήτων.Το 1990 έγινε μέλος της Ελληνικής Ομοσπονδίας Τάεκβοντο
          (ΕΛ.Ο.Τ) και από τότε έως και σήμερα έχει να παρουσιάσει πληθώρα
          δραστηριοτήτων και επιτυχιών, τόσο σε επαρχιακό, σε πανελλήνιο όσο και
          σε διεθνές επίπεδο που καθιστούν τον σύλλογό μας επάξια σε έναν από
          τους πιο οργανωμένους και πρωτοποριακούς συλλόγους της χώρας μας.
          Μετράει στο ενεργητικό του 6 Παγκόσμιες διακρίσεις, 19 Πανευρωπαϊκές,
          2 Μεσογειακές, 2 Βαλκανικές και περισσότερα 350 Πανελλήνια μετάλλια!
        </p>
        <p className={classes.text_intro}>
          Αξίζει να αναφερθεί, ότι τα τελευταία 15 χρόνια κατατάσσεται στις
          πρώτες θέσεις της Γενικής Κατάταξη των συλλόγων της χώρας μας, μεταξύ
          450 Σωματείων της δύναμης της Ομοσπονδίας, στις κατηγορίες
          Παίδων–Κορασίδων, Εφήβων–Νεανίδων, Ανδρών–Γυναικών.
        </p>
        <ul
          initial="hidden"
          animate="enter"
          exit="exit"
          variants={variants}
          transition={{ type: "linear" }}
          className={classes.text_introlist}
        >
          {/* <ul>  */}
          <li>
            Το 2003-2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΠΑΙΔΩΝ/ΚΟΡΑΣΙΔΩΝ
          </li>
          <li>
            Το 2004–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΠΑΙΔΩΝ /ΚΟΡΑΣΙΔΩΝ{" "}
          </li>
          <li>
            Το 2005–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΕΦΗΒΩΝ /ΝΕΑΝΙΔΩΝ{" "}
          </li>
          <li>
            Το 2006–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΕΦΗΒΩΝ /ΝΕΑΝΙΔΩΝ{" "}
          </li>
          <li>
            Το 2007–2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΠΑΙΔΩΝ /ΚΟΡΑΣΙΔΩΝ{" "}
          </li>
          <li>
            Το 2008–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ{" "}
          </li>
          <li>
            Το 2009–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ{" "}
          </li>
          <li>
            Το 2010–2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΕΦΗΒΩΝ /ΝΕΑΝΙΔΩΝ &
            Α/Γ{" "}
          </li>
          <li>
            Το 2011–2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ{" "}
          </li>
          <li>Το 2012–2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΝΕΩΝ ΑΝΔΡΩΝ</li>
          <li>
            Το 2013–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ
          </li>
          <li>
            Το 2014–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ
          </li>
          <li>
            Το 2015–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ / ΓΥΝΑΙΚΩΝ
          </li>
          <li>
            Το 2018–1º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΠΑΙΔΩΝ /ΚΟΡΑΣΙΔΩΝ
          </li>
          <li>
            Το 2019–2º ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΕΦΗΒΩΝ /ΝΕΑΝΙΔΩΝ
          </li>
          <li>& 3ο ΣΥΛΛΟΓΟ ΠΑΝΕΛΛΑΔΙΚΑ ΣΤΙΣ ΚΑΤΗΓΟΡΙΕΣ ΑΝΔΡΩΝ /ΓΥΝΑΙΚΩΝ</li>
          {/* </ul> */}
        </ul>

        <p className={classes.text_intro}>
          Η πιο πρόσφατη και μεγαλύτερη επιτυχία μας είναι η κατάκτηση του
          αργυρού Παγκόσμιου μεταλλίου του Τεληκωστόγλου Απόστολου, στο
          Μάντσεστερ της Αγγλίας, στην κατηγορία των -80kg Ανδρών. Η
          συγκεκριμένη διάκριση, αποτελεί την την μια από τις 2 μεγαλύτερες
          διακρίσεις Ελλήνων όλων των ολυμπιακών αθλημάτων για το 2019
        </p>
        <p className={classes.text_intro}>
          Τέλος, αξίζει να σημειωθεί, ότι όλοι οι διακεκριμένοι αθλητές μας σε
          Παγκόσμιο και Πανευρωπαϊκό επίπεδο εισήχθησαν στα Ανώτατα Εκπαιδευτικά
          Ιδρύματα της χώρας μας χωρίς εξετάσεις, οι δε Πανελληνιονίκες
          μοριοδοτήθηκαν για την εισαγωγή τους στα Α.Ε.Ι. ανάλογα με την ηλικία
          τους.
        </p>
        <button onClick={Home} className={classes.button}>
          Επιστροφή στην Αρχική Σελίδα
        </button>
      </div>
    </>
  );
}

export default History;
